Can't place inserts outside of hosts. These elements won't be copied.
  Namespace:   Autodesk.Revit.DB
  Assembly:   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
 Syntax
  C#
public static FailureDefinitionId CantPlaceInsertsWarning { get; }
  Visual Basic
Public Shared ReadOnly Property CantPlaceInsertsWarning As FailureDefinitionId
	Get
  Visual C++
public:
static property FailureDefinitionId^ CantPlaceInsertsWarning {
	FailureDefinitionId^ get ();
}
 See Also
  BuiltInFailures FamilyFailures Class
  Autodesk.Revit.DB Namespace